Bhuner23/Patient-Monitoring-System-With-STM32F4/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define CS_I2C_SPI_Pin GPIO_PIN_3
#define CS_I2C_SPI_GPIO_Port GPIOE
#define PR_PAGE_BUTTON_Pin GPIO_PIN_4
#define PR_PAGE_BUTTON_GPIO_Port GPIOE
#define PR_SHIFT_BUTTON_Pin GPIO_PIN_5
#define PR_SHIFT_BUTTON_GPIO_Port GPIOE
#define PR_ACKNOWLEDGE_BUTTON_Pin GPIO_PIN_6
#define PR_ACKNOWLEDGE_BUTTON_GPIO_Port GPIOE
#define PC14_OSC32_IN_Pin GPIO_PIN_14
#define PC14_OSC32_IN_GPIO_Port GPIOC
#define PC15_OSC32_OUT_Pin GPIO_PIN_15
#define PC15_OSC32_OUT_GPIO_Port GPIOC
#define PH0_OSC_IN_Pin GPIO_PIN_0
#define PH0_OSC_IN_GPIO_Port GPIOH
#define PH1_OSC_OUT_Pin GPIO_PIN_1
#define PH1_OSC_OUT_GPIO_Port GPIOH
#define OTG_FS_PowerSwitchOn_Pin GPIO_PIN_0
#define OTG_FS_PowerSwitchOn_GPIO_Port GPIOC
#define PR_BUZZER_Pin GPIO_PIN_1
#define PR_BUZZER_GPIO_Port GPIOC
#define PDM_OUT_Pin GPIO_PIN_3
#define PDM_OUT_GPIO_Port GPIOC
#define PR_SYSTEM_RESET_BUTTON_Pin GPIO_PIN_0
#define PR_SYSTEM_RESET_BUTTON_GPIO_Port GPIOA
#define PR_H_RATE_THRESHOLD_Pin GPIO_PIN_1
#define PR_H_RATE_THRESHOLD_GPIO_Port GPIOA
#define PR_B_TEMP_THRESHOLD_Pin GPIO_PIN_2
#define PR_B_TEMP_THRESHOLD_GPIO_Port GPIOA
#define I2S3_WS_Pin GPIO_PIN_4
#define I2S3_WS_GPIO_Port GPIOA
#define SPI1_SCK_Pin GPIO_PIN_5
#define SPI1_SCK_GPIO_Port GPIOA
#define SPI1_MISO_Pin GPIO_PIN_6
#define SPI1_MISO_GPIO_Port GPIOA
#define SPI1_MOSI_Pin GPIO_PIN_7
#define SPI1_MOSI_GPIO_Port GPIOA
#define PR_PATIENT_OCCUPANCY_DET_Pin GPIO_PIN_0
#define PR_PATIENT_OCCUPANCY_DET_GPIO_Port GPIOB
#define PR_EMERGENCY_CALL_BUT_Pin GPIO_PIN_1
#define PR_EMERGENCY_CALL_BUT_GPIO_Port GPIOB
#define PR_EMERGENCY_CALL_BUT_EXTI_IRQn EXTI1_IRQn
#define BOOT1_Pin GPIO_PIN_2
#define BOOT1_GPIO_Port GPIOB
#define CLK_IN_Pin GPIO_PIN_10
#define CLK_IN_GPIO_Port GPIOB
#define PR_STM_USART3_RX_Pin GPIO_PIN_11
#define PR_STM_USART3_RX_GPIO_Port GPIOB
#define PR_STM_USART3_TX_Pin GPIO_PIN_8
#define PR_STM_USART3_TX_GPIO_Port GPIOD
#define LD4_Pin GPIO_PIN_12
#define LD4_GPIO_Port GPIOD
#define LD3_Pin GPIO_PIN_13
#define LD3_GPIO_Port GPIOD
#define LD5_Pin GPIO_PIN_14
#define LD5_GPIO_Port GPIOD
#define LD6_Pin GPIO_PIN_15
#define LD6_GPIO_Port GPIOD
#define I2S3_MCK_Pin GPIO_PIN_7
#define I2S3_MCK_GPIO_Port GPIOC
#define PR_LCD_EEPROM_SDA_Pin GPIO_PIN_9
#define PR_LCD_EEPROM_SDA_GPIO_Port GPIOC
#define PR_LCD_EEPROM_SCL_Pin GPIO_PIN_8
#define PR_LCD_EEPROM_SCL_GPIO_Port GPIOA
#define VBUS_FS_Pin GPIO_PIN_9
#define VBUS_FS_GPIO_Port GPIOA
#define OTG_FS_ID_Pin GPIO_PIN_10
#define OTG_FS_ID_GPIO_Port GPIOA
#define OTG_FS_DM_Pin GPIO_PIN_11
#define OTG_FS_DM_GPIO_Port GPIOA
#define OTG_FS_DP_Pin GPIO_PIN_12
#define OTG_FS_DP_GPIO_Port GPIOA
#define SWDIO_Pin GPIO_PIN_13
#define SWDIO_GPIO_Port GPIOA
#define SWCLK_Pin GPIO_PIN_14
#define SWCLK_GPIO_Port GPIOA
#define I2S3_SCK_Pin GPIO_PIN_10
#define I2S3_SCK_GPIO_Port GPIOC
#define I2S3_SD_Pin GPIO_PIN_12
#define I2S3_SD_GPIO_Port GPIOC
#define PR_SYSTEM_ON_LED_Pin GPIO_PIN_1
#define PR_SYSTEM_ON_LED_GPIO_Port GPIOD
#define PR_HEART_RATE_LED_Pin GPIO_PIN_2
#define PR_HEART_RATE_LED_GPIO_Port GPIOD
#define PR_BODY_TEMPERATURE_LED_Pin GPIO_PIN_3
#define PR_BODY_TEMPERATURE_LED_GPIO_Port GPIOD
#define Audio_RST_Pin GPIO_PIN_4
#define Audio_RST_GPIO_Port GPIOD
#define OTG_FS_OverCurrent_Pin GPIO_PIN_5
#define OTG_FS_OverCurrent_GPIO_Port GPIOD
#define PR_EMERGENCY_CALL_LED_Pin GPIO_PIN_6
#define PR_EMERGENCY_CALL_LED_GPIO_Port GPIOD
#define PR_PATIENT_OCCUPANCY_LED_Pin GPIO_PIN_7
#define PR_PATIENT_OCCUPANCY_LED_GPIO_Port GPIOD
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define PR_MAX30102_SCL_Pin GPIO_PIN_6
#define PR_MAX30102_SCL_GPIO_Port GPIOB
#define PR_DS18B20_DATA_Pin GPIO_PIN_7
#define PR_DS18B20_DATA_GPIO_Port GPIOB
#define PR_MAX30102_INT_Pin GPIO_PIN_8
#define PR_MAX30102_INT_GPIO_Port GPIOB
#define PR_MAX30102_INT_EXTI_IRQn EXTI9_5_IRQn
#define PR_MAX30102_SDA_Pin GPIO_PIN_9
#define PR_MAX30102_SDA_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
